---
kind: enumMember
id: F:Autodesk.Revit.DB.PointOnCurveMeasurementType.Angle
enum: Autodesk.Revit.DB.PointOnCurveMeasurementType
source: html/8bd00c68-1bcd-9bc9-c246-0f0c96962146.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasurementType.Angle

Angle - defined only for arc and circle.
 It is the angle subtended at the center by the portion of the curve from the star to the given point.